app/controllers/posts_controller.rb

    def index
        # Get all posts
        @posts = Post.all
---
SELECT "posts".* FROM "posts"

    def show
        # Find the post object from sqlite using the id
        @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        # Will print out all the parameters sent from the form
        # render plain: params[:post].inspect

        # Create a new post with the form data
        @post = Post.new(post_params)

        # Save post in sqlite
        if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1232323"], ["body", "123"], ["created_at", "2019-05-08 18:18:04.126137"], ["updated_at", "2019-05-08 18:18:04.126137"]]

    def update
        @post = Post.find(params[:id])
        # Update post in sqlite
        if(@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Test title"], ["body", "Test Body"], ["updated_at", "2019-05-08 18:12:46.324556"], ["id", 1]]